import CEO from "@/public/CEO.png"; // Assuming you have a CEO image

export const hero = {
  title: "تحويل المساحات الخارجية",
  subtitle: "بلمسة طبيعية فريدة",
  description:
    "نقدم خدمات تنسيق حدائق احترافية واعتمادًا على النباتات المصرية الأصيلة، لننشئ مساحات خارجية مبهرة تلهم حواسك وتعزز رفاهيتك.",
  projectsCompleted: "مشاريع مُكتملة",
  yearsExperience: "سنوات خبرة",
  happyClients: "عملاء راضون",
};

export const about = {
  mission: "مهمتنا",
  missionText:
    "تقديم تصميمات مناظر طبيعية خارجية متكاملة تجمع بين الجمال والوظيفة، باستخدام النباتات المصرية الأصيلة وأساليب مستدامة، لخلق بيئات تعزز راحة المستخدمين وتدعم الحفاظ على الموارد الطبيعية.",
  vision: "رؤيتنا",
  visionText:
    "أن تصبح Macca Landscape الرائدة في مصر في تصميم المناظر الطبيعية، معروفة بابتكاراتها واستدامتها وقدرتها على خلق مساحات خضراء تلهم الناس وتعيد التواصل بين الحياة اليومية والطبيعة.",
  meetTeam: "تعرف على فريقنا",
  teamSubtitle:
    "فريقنا المتحمس من الخبراء يجلب سنوات من الخبرة والإبداع لكل مشروع نقوم به",
};

export const team = [
  {
    name: "م/ محمد رمضان",
    role: "المؤسس والمصمم الرئيسي",
    description: "متخصص في تصميم المساحات الخارجية المستدامة والجمالية.",
    profileImage: CEO,
  },
];
